In [1]:
import pandas as pd

In [2]:
series1 = pd.Series([10,20,30])

In [3]:
print(series1)

0    10
1    20
2    30
dtype: int64

In [4]:
series2 = pd.Series(["Kavi","Shyam","Ravi"], index = [3,5,1])

In [5]:
print(series2)

3     Kavi
5    Shyam
1     Ravi
dtype: object

In [6]:
import numpy as np

In [7]:
array1 = np.array([1,2,3,4])

In [8]:
print(array1)

[1 2 3 4]

In [9]:
series3 = pd.Series(array1)

In [10]:
print(series3)

0    1
1    2
2    3
3    4
dtype: int32

In [11]:
dict1 = {'India':'NewDelhi','Uk':'London','Japan':'Tokyo'}

In [12]:
print(dict1)

{'India': 'NewDelhi', 'Uk': 'London', 'Japan': 'Tokyo'}

In [13]:
series4 = pd.Series(dict1)

In [14]:
print(series4)

India    NewDelhi
Uk         London
Japan       Tokyo
dtype: object

In [15]:
print(series1)

0    10
1    20
2    30
dtype: int64

In [17]:
series1[1]

20

In [19]:
series1[[1,2]]

1    20
2    30
dtype: int64

In [ ]:
#Creation of Series

In [20]:
#Accessing
#1 indexing

In [ ]:
#Slicing

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
series5 = pd.Series(['Raj','Hari Om','Aman','Nitish'],index = ['st1','st2','st3','st4'])

In [4]:
print(series5)

st1        Raj
st2    Hari Om
st3       Aman
st4     Nitish
dtype: object

In [5]:
series5[0:2]

st1        Raj
st2    Hari Om
dtype: object

In [6]:
series5[-1]

'Nitish'

In [7]:
series5[: : -1]

st4     Nitish
st3       Aman
st2    Hari Om
st1        Raj
dtype: object

In [9]:
seriesnp = pd.Series(np.arange(10,16,1),index = ['a','b','c','d','e','f'])

In [10]:
print(seriesnp)

a    10
b    11
c    12
d    13
e    14
f    15
dtype: int32

In [ ]:
Hari Om
Raj Dubey
Aman Tiwari
Nitish Kumar

In [12]:
seriesname = pd.Series(['Om','Dubey','Tiwari','Kumar'],index=['Hari','Raj','Aman','Nitish'])

In [13]:
print(seriesname)

Hari          Om
Raj        Dubey
Aman      Tiwari
Nitish     Kumar
dtype: object

In [15]:
seriesname = pd.Series(['Om','Dubey','Tiwari','Kumar'],['Hari','Raj','Aman','Nitish'])

In [16]:
print(seriesname)

Hari          Om
Raj        Dubey
Aman      Tiwari
Nitish     Kumar
dtype: object

In [17]:
seriesname[0] = 'Dev'

In [18]:
print(seriesname)

Hari         Dev
Raj        Dubey
Aman      Tiwari
Nitish     Kumar
dtype: object

In [19]:
seriesname['Aman'] = 'Dev'

In [20]:
print(seriesname)

Hari        Dev
Raj       Dubey
Aman        Dev
Nitish    Kumar
dtype: object

In [21]:
#2.2.3 Attributes of Series

In [22]:
print(seriesname.values)

['Dev' 'Dubey' 'Dev' 'Kumar']

In [23]:
print(seriesname.size)

4

In [24]:
#.2.4 Methods of Series

In [25]:
#home work 1 check table commands
#home work 2 Perform activity 2.3

In [26]:
s = pd.Series(np.arange(10, 20, 1))

In [27]:
s

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [30]:
s = pd.Series(np.arange(10, 20, 1))

In [31]:
s

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [33]:
s.head(2)

0    10
1    11
dtype: int32

In [34]:
s.tail(2)

8    18
9    19
dtype: int32

In [35]:
s.count()

10

In [36]:
seriesA = pd.Series([1,2,3,4,5], index = ['a', 'b', 'c', 'd', 'e'])

In [37]:
seriesB = pd.Series([10,20,-10,-50,100], 
index = ['z', 'y', 'a', 'c', 'e'])

In [38]:
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [39]:
seriesB

z     10
y     20
a    -10
c    -50
e    100
dtype: int64

In [40]:
seriesA + seriesB

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [41]:
seriesA.add(seriesB, fill_value=0)

a     -9.0
b      2.0
c    -47.0
d      4.0
e    105.0
y     20.0
z     10.0
dtype: float64

In [42]:
#B) Subtraction of two Series

In [3]:
#Ans 2 Scaler Values
import pandas as pd

s = pd.Series([5,10,15,20,25,30,35,40,45,50])

print(s)

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
9    50
dtype: int64

In [6]:
#Ans 2 NumPy Array
import pandas as pd
import numpy as np

s2 = pd.Series(np.arange(5,51,5))


print(s2)

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
9    50
dtype: int32

In [8]:
#Ans 3
mon = pd.Series(['jan','Feb','March','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec'],index = [1,2,3,4,5,6,7,8,9,10,11,12])

In [9]:
mon

1       jan
2       Feb
3     March
4       Apr
5       May
6       Jun
7       Jul
8       Aug
9       Sep
10      Oct
11      Nov
12      Dec
dtype: object

In [14]:
#Ans 4
mon2 = pd.Series([31,28,31,30,31,30,31,31,30,31,30,31], index = ['jan','Feb','March','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec'])

In [13]:
mon2

jan      31
Feb      28
March    31
Apr      30
May      31
Jun      30
Jul      31
Aug      31
Sep      30
Oct      31
Nov      30
Dec      31
dtype: int64

In [15]:
#Ans 5
mon2.name = "Months and Number of Days"

In [16]:
mon2

jan      31
Feb      28
March    31
Apr      30
May      31
Jun      30
Jul      31
Aug      31
Sep      30
Oct      31
Nov      30
Dec      31
Name: Months and Number of Days, dtype: int64

In [17]:
# Addition of Series

In [18]:
3 +4

7

In [19]:
2+8

10

In [26]:
2 + 0

2

In [21]:
series21 = pd.Series([10,30,50,90,300],index=[2,4,6,8,9])

In [22]:
series21

2     10
4     30
6     50
8     90
9    300
dtype: int64

In [23]:
series22 = pd.Series([100,350,500,900,100],index=[2,3,6,7,9])

In [24]:
series22

2    100
3    350
6    500
7    900
9    100
dtype: int64

In [25]:
series21 + series22

2    110.0
3      NaN
4      NaN
6    550.0
7      NaN
8      NaN
9    400.0
dtype: float64

In [27]:
series21.add(series22)

2    110.0
3      NaN
4      NaN
6    550.0
7      NaN
8      NaN
9    400.0
dtype: float64

In [29]:
series21.add(series22, fill_value=5)

2    110.0
3    355.0
4     35.0
6    550.0
7    905.0
8     95.0
9    400.0
dtype: float64

In [30]:
series21.add(series22, fill_value=50)

2    110.0
3    400.0
4     80.0
6    550.0
7    950.0
8    140.0
9    400.0
dtype: float64

In [32]:
series22.add(series21, fill_value=50)

2    110.0
3    400.0
4     80.0
6    550.0
7    950.0
8    140.0
9    400.0
dtype: float64

In [1]:
series21 - series22

NameError: name 'series21' is not defined

In [33]:
series22 - series21

2     90.0
3      NaN
4      NaN
6    450.0
7      NaN
8      NaN
9   -200.0
dtype: float64

In [34]:
series21.sub(series22, fill_value=50)

2    -90.0
3   -300.0
4    -20.0
6   -450.0
7   -850.0
8     40.0
9    200.0
dtype: float64

In [35]:
#DataFrame

In [3]:
import pandas as pd

In [4]:
series21 = pd.Series([10,30,50,90,300],index=[2,4,6,8,9])

In [5]:
series22 = pd.Series([100,350,500,900,100],index=[2,3,6,7,9])

In [6]:
series22 / series21

2    10.000000
3          NaN
4          NaN
6    10.000000
7          NaN
8          NaN
9     0.333333
dtype: float64

In [6]:
series21.div(series22, fill_value=50)

2    0.100000
3    0.142857
4    0.600000
6    0.100000
7    0.055556
8    1.800000
9    3.000000
dtype: float64

In [7]:
# Series completed

In [8]:
#DATA FRAME

In [9]:
#2.3.1 Creation of DataFrame

In [10]:
empd = pd.DataFrame()

In [12]:
print(empd)

Empty DataFrame
Columns: []
Index: []

In [13]:
#(B) Creation of DataFrame from NumPy ndarrays

In [14]:
import numpy as np

In [15]:
array1 = np.array([10,20,30])
array2 = np.array([100,200,300])
array3 = np.array([-10,-20,-30, -40])

In [17]:
series11 = pd.Series(array1)
series11

0    10
1    20
2    30
dtype: int32

In [18]:
dframe1 = pd.DataFrame(array1)
dframe1

    0
0  10
1  20
2  30

In [22]:
dFrame2 = pd.DataFrame([array1, array3, 
array2], columns=[ 'A', 'B', 'C', 'D'])
dFrame2

     A    B    C     D
0   10   20   30   NaN
1  -10  -20  -30 -40.0
2  100  200  300   NaN

In [23]:
#(C) Creation of DataFrame from List of Dictionaries

In [24]:
dict = [{'a':10, 'b':20}, {'a':5,'b':10, 'c':20}]

In [25]:
dict

[{'a': 10, 'b': 20}, {'a': 5, 'b': 10, 'c': 20}]

In [26]:
dfl = pd.DataFrame(dict)

In [28]:
dfl

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [29]:
#(D) Creation of DataFrame from Dictionary of Lists

In [30]:
dictForest = {
    'State': ['Assam', 'Delhi', 
'Kerala'],
    'GArea': [78438, 1483, 38852] ,
              'VDF' : [2797, 6.72,1663]}

In [31]:
dictForest

{'State': ['Assam', 'Delhi', 'Kerala'],
 'GArea': [78438, 1483, 38852],
 'VDF': [2797, 6.72, 1663]}

In [32]:
dfdl = pd.DataFrame(dictForest)

In [33]:
dfdl

    State  GArea      VDF
0   Assam  78438  2797.00
1   Delhi   1483     6.72
2  Kerala  38852  1663.00

In [34]:
dfdl2 = pd.DataFrame(dictForest,columns = ['VDF','State','GArea'])

In [36]:
dfdl2

       VDF   State  GArea
0  2797.00   Assam  78438
1     6.72   Delhi   1483
2  1663.00  Kerala  38852

In [37]:
#(E) Creation of DataFrame from Series

In [38]:
seriesA = pd.Series([1,2,3,4,5],
index = ['a', 'b', 'c', 'd', 'e'])

In [39]:
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [40]:
seriesB = pd.Series ([1000,2000,-1000,-5000,1000],
index = ['a', 'b', 'c', 'd', 'e'])

In [41]:
seriesB

a    1000
b    2000
c   -1000
d   -5000
e    1000
dtype: int64

In [42]:
seriesC = pd.Series([10,20,-10,-50,100],
index = ['z', 'y', 'a', 'c', 'e'])

In [43]:
seriesC

z     10
y     20
a    -10
c    -50
e    100
dtype: int64

In [44]:
dfseries = pd.DataFrame(seriesA)

In [46]:
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [45]:
dfseries

   0
a  1
b  2
c  3
d  4
e  5

In [49]:
dfseries = pd.DataFrame([seriesA,seriesB,seriesC])

In [50]:
dfseries

        a       b       c       d       e     z     y
0     1.0     2.0     3.0     4.0     5.0   NaN   NaN
1  1000.0  2000.0 -1000.0 -5000.0  1000.0   NaN   NaN
2   -10.0     NaN   -50.0     NaN   100.0  10.0  20.0

In [51]:
# (F) Creation of DataFrame from Dictionary of Series

In [7]:
ResultSheet={
'Arnab': pd.Series([90, 91, 97],
index=['Maths','Science','Hindi']),
'Ramit': pd.Series([92, 81, 96],
index=['Maths','Science','Hindi']),
'Samridhi': pd.Series([89, 91, 88],
index=['Maths','Science','Hindi']),
'Riya': pd.Series([81, 71, 67],
index=['Maths','Science','Hindi']),
'Mallika': pd.Series([94, 95, 99],
index=['Maths','Science','Hindi'])}

In [8]:
ResultSheet

{'Arnab': Maths      90
 Science    91
 Hindi      97
 dtype: int64,
 'Ramit': Maths      92
 Science    81
 Hindi      96
 dtype: int64,
 'Samridhi': Maths      89
 Science    91
 Hindi      88
 dtype: int64,
 'Riya': Maths      81
 Science    71
 Hindi      67
 dtype: int64,
 'Mallika': Maths      94
 Science    95
 Hindi      99
 dtype: int64}

In [9]:
ResultDF = pd.DataFrame(ResultSheet)

In [10]:
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [11]:
#2.3.2 Operations on rows and columns in DataFrames

In [12]:
#(A) Adding a New Column to a DataFrame

In [13]:
ResultDF['Raj'] = [88,92,94]

In [14]:
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Raj
Maths       90     92        89    81       94   88
Science     91     81        91    71       95   92
Hindi       97     96        88    67       99   94

In [15]:
ResultDF['Nitish'] = [98,88,94]

In [16]:
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Raj  Nitish
Maths       90     92        89    81       94   88      98
Science     91     81        91    71       95   92      88
Hindi       97     96        88    67       99   94      94

In [17]:
ResultDF['Arnab'] = [98,88,94]

In [18]:
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Raj  Nitish
Maths       98     92        89    81       94   88      98
Science     88     81        91    71       95   92      88
Hindi       94     96        88    67       99   94      94

In [19]:
ResultDF['Samridhi'] = 95

In [20]:
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Raj  Nitish
Maths       98     92        95    81       94   88      98
Science     88     81        95    71       95   92      88
Hindi       94     96        95    67       99   94      94

In [21]:
#(B) Adding a New Row to a DataFrame

In [22]:
ResultDF.loc['Computer'] = [84,88,92,94,89,88,91]

In [23]:
ResultDF

          Arnab  Ramit  Samridhi  Riya  Mallika  Raj  Nitish
Maths        98     92        95    81       94   88      98
Science      88     81        95    71       95   92      88
Hindi        94     96        95    67       99   94      94
Computer     84     88        92    94       89   88      91

In [24]:
ResultDF.loc['Computer'] = 90
ResultDF

          Arnab  Ramit  Samridhi  Riya  Mallika  Raj  Nitish
Maths        98     92        95    81       94   88      98
Science      88     81        95    71       95   92      88
Hindi        94     96        95    67       99   94      94
Computer     90     90        90    90       90   90      90

In [25]:
ResultDF[:] = 80
ResultDF

          Arnab  Ramit  Samridhi  Riya  Mallika  Raj  Nitish
Maths        80     80        80    80       80   80      80
Science      80     80        80    80       80   80      80
Hindi        80     80        80    80       80   80      80
Computer     80     80        80    80       80   80      80

In [26]:
#(C) Deleting Rows or Columns from a DataFrame

In [27]:
ResultDF

          Arnab  Ramit  Samridhi  Riya  Mallika  Raj  Nitish
Maths        80     80        80    80       80   80      80
Science      80     80        80    80       80   80      80
Hindi        80     80        80    80       80   80      80
Computer     80     80        80    80       80   80      80

In [28]:
ResultDF = ResultDF.drop('Computer', axis =0)

In [29]:
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Raj  Nitish
Maths       80     80        80    80       80   80      80
Science     80     80        80    80       80   80      80
Hindi       80     80        80    80       80   80      80

In [30]:
# X axis = row (axis=0)
#Y axis = column (axis =1)

In [31]:
#For row = ResultDF = ResultDF.drop('RowName', axis =0)
#For Column = ResultDF = ResultDF.drop('ColumnName', axis =1)

In [32]:
ResultDF = ResultDF.drop('Ramit', axis =1)

In [33]:
ResultDF

         Arnab  Samridhi  Riya  Mallika  Raj  Nitish
Maths       80        80    80       80   80      80
Science     80        80    80       80   80      80
Hindi       80        80    80       80   80      80

In [34]:
#(D) Renaming Row Labels of a DataFrame

In [35]:
ResultDF = ResultDF.rename({'Science':'Computer','Hindi':'English'})

In [36]:
ResultDF

          Arnab  Samridhi  Riya  Mallika  Raj  Nitish
Maths        80        80    80       80   80      80
Computer     80        80    80       80   80      80
English      80        80    80       80   80      80

In [40]:
#(E) Renaming Column Labels of a DataFrame

In [44]:
ResultDF = ResultDF.rename({'Riya':'Pooja','Mallika':'Arora'},axis = 'columns')

In [45]:
ResultDF

          Arnab  Samridhi  Pooja  Arora  Raj  Nitish
Maths        80        80     80     80   80      80
Computer     80        80     80     80   80      80
English      80        80     80     80   80      80

In [46]:
#2.3.3 Accessing DataFrames Element through Indexing

In [47]:
ResultDF = ResultDF.rename({'Riya':'Pooja','Mallika':'Arora'},axis = 1)

In [48]:
ResultDF

          Arnab  Samridhi  Pooja  Arora  Raj  Nitish
Maths        80        80     80     80   80      80
Computer     80        80     80     80   80      80
English      80        80     80     80   80      80

In [1]:
#(A) Label Based Indexing

In [37]:
ResultDF

          Arnab  Samridhi  Riya  Mallika  Raj  Nitish
Maths        80        80    80       80   80      80
Computer     80        80    80       80   80      80
English      80        80    80       80   80      80

In [38]:
ResultDF.loc['Computer']

Arnab       80
Samridhi    80
Riya        80
Mallika     80
Raj         80
Nitish      80
Name: Computer, dtype: int64

In [39]:
df2 = pd.DataFrame([1,2,3,4,5,6,7,8])

In [40]:
df2

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8

In [43]:
df2.loc[3]

0    4
Name: 3, dtype: int64

In [44]:
ResultDF.loc['Computer']

Arnab       80
Samridhi    80
Riya        80
Mallika     80
Raj         80
Nitish      80
Name: Computer, dtype: int64

In [45]:
#(B) Boolean Indexing

In [48]:
ResultDF.loc['Computer'] >=80

Arnab       True
Samridhi    True
Riya        True
Mallika     True
Raj         True
Nitish      True
Name: Computer, dtype: bool

In [50]:
ResultDF.loc['Computer'] =>80

SyntaxError: invalid syntax (<ipython-input-50-def6ff579497>, line 1)

In [49]:
#2.3.4 Accessing DataFrames Element through Slicing

In [51]:
ResultDF

          Arnab  Samridhi  Riya  Mallika  Raj  Nitish
Maths        80        80    80       80   80      80
Computer     80        80    80       80   80      80
English      80        80    80       80   80      80

In [52]:
ResultDF.loc['Computer':'English']

          Arnab  Samridhi  Riya  Mallika  Raj  Nitish
Computer     80        80    80       80   80      80
English      80        80    80       80   80      80

In [61]:
ResultDF.loc['English':'Computer','Raj']

Series([], Name: Raj, dtype: int64)

In [65]:
zz = ResultDF.loc['Computer':'English',['Raj','Riya']]

In [66]:
zz

          Raj  Riya
Computer   80    80
English    80    80

In [67]:
zz = ResultDF.loc['Computer':'English','Raj':'Riya']

In [68]:
zz

Empty DataFrame
Columns: []
Index: [Computer, English]

In [69]:
yz = ResultDF.loc['Computer':'English','Riya':'Raj']

In [70]:
yz

          Riya  Mallika  Raj
Computer    80       80   80
English     80       80   80

In [71]:
#2.3.5 Joining, Merging and Concatenation of  DataFrames

In [1]:
import pandas as pd

In [2]:
dfram11 = pd.DataFrame([[1,2,3],[4,5],[6]], columns = ['c1','c2','c3'], index = ['r1','r2','r3'])

In [3]:
dfram11

    c1   c2   c3
r1   1  2.0  3.0
r2   4  5.0  NaN
r3   6  NaN  NaN

In [5]:
dfram12 = pd.DataFrame([[10,20],[30],[40,50]], columns = ['c2','c5'], index=['r4','r2','r5'])

In [6]:
dfram12

    c2    c5
r4  10  20.0
r2  30   NaN
r5  40  50.0

In [8]:
dfappend = dfram11.append(dfram12)
dfappend

     c1    c2   c3    c5
r1  1.0   2.0  3.0   NaN
r2  4.0   5.0  NaN   NaN
r3  6.0   NaN  NaN   NaN
r4  NaN  10.0  NaN  20.0
r2  NaN  30.0  NaN   NaN
r5  NaN  40.0  NaN  50.0

In [11]:
dfappend2 = dfram11.append(dfram12, sort = 'True')

In [12]:
dfappend2

     c1    c2   c3    c5
r1  1.0   2.0  3.0   NaN
r2  4.0   5.0  NaN   NaN
r3  6.0   NaN  NaN   NaN
r4  NaN  10.0  NaN  20.0
r2  NaN  30.0  NaN   NaN
r5  NaN  40.0  NaN  50.0

In [ ]:
#DataStructure two types

1 Series
a=pd.Series()

2 DataFrame
b=pd.DataFrame()

In [ ]:
#2.3.6 Attributes of DataFrames

In [1]:
import pandas as pd

In [5]:
dictState = {'State': ['UP', 'Delhi', 
'Rajsthan','Punjab','Himachal Pradesh'],
'Capital': ['Lucknow', 'Delhi', 'Jaipur','Chandigadh','Shimla'] }

In [6]:
dictState

{'State': ['UP', 'Delhi', 'Rajsthan', 'Punjab', 'Himachal Pradesh'],
 'Capital': ['Lucknow', 'Delhi', 'Jaipur', 'Chandigadh', 'Shimla']}

In [7]:
state = pd.DataFrame(dictState)

In [8]:
state

              State     Capital
0                UP     Lucknow
1             Delhi       Delhi
2          Rajsthan      Jaipur
3            Punjab  Chandigadh
4  Himachal Pradesh      Shimla